# -*- coding: utf-8 -*-
import pandas as pd

# 데이터 생성
data = {
    '이름': ['한민', '박성현', '정수현', '차가은', '오한식','A','B','C','D','E','F','G','H','I','J','K','L','M','O','P','Q','R','S','T','U','V','W','X','Y','Z','!','@','1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48'],
    '전체총평점': [3.9, 3.4, 3.5, 3.7, 4.1, 3.3, 3.2, 2.1, 4.3, 3.2 ,3.3, 3.4, 3.6, 3.5, 3.2, 2.9, 3.1, 2.1, 3.0, 2.2, 3.6, 2.9, 2.8, 3.2, 3.6, 2.7, 2.6, 2.9, 4.1, 4.2, 3.2, 2.3, 4.1, 3.3, 3.2, 2.1, 4.3, 3.2 ,3.3, 3.4, 3.6, 3.5, 3.2, 2.9, 3.1, 2.1, 3.0, 2.2, 3.6, 2.9, 2.8, 3.2, 3.6, 2.7, 2.6, 2.9, 4.1, 4.2, 3.2, 2.3, 3.9, 3.4, 3.5, 3.7, 4.1, 3.3, 3.2, 2.1, 4.3, 3.2 ,3.3, 3.4, 3.6, 3.5, 3.2, 2.9, 3.1, 2.1, 3.0, 2.2],
    '1지망': ['박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '도재수', '도재수', '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0'],
    '2지망': ['박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '박소현', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '오승현', '오승현', '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0'],
    '3지망': ['도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '도재수', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '박기석', '박기석', '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0' ],
    '4지망': ['오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '오승현', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박기석', '박소현', '박소현', '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0',  '0']
}


# 데이터프레임 생성
df = pd.DataFrame(data)

# Excel 파일로 저장
df.to_excel('example.xlsx', index=True)
'''
print('sel1 : ', end=' ')
sel11 = []
for i in range(80):
    if i < 20:
        sel11.append('박기석')
    elif i > 19 and i < 40:
        sel11.append('박소현')
    elif i > 39 and i < 60:
        sel11.append('도재수')
    else:
        sel11.append('오승현')
print(sel11)

print('sel2 : ', end=' ')
sel22 = []
for i in range(80):
    if i < 20:
        sel22.append('박소현')
    elif i > 19 and i < 40:
        sel22.append('도재수')
    elif i > 39 and i < 60:
        sel22.append('오승현')
    else:
        sel22.append('박기석')
print(sel22)

print('sel3 : ', end=' ')
sel33 = []
for i in range(80):
    if i < 20:
        sel33.append('도재수')
    elif i > 19 and i < 40:
        sel33.append('오승현')
    elif i > 39 and i < 60:
        sel33.append('박기석')
    else:
        sel33.append('박소현')
print(sel33)

print('sel4 : ', end=' ')
sel44 = []
for i in range(80):
    if i < 20:
        sel44.append('오승현')
    elif i > 19 and i < 40:
        sel44.append('박기석')
    elif i > 39 and i < 60:
        sel44.append('박소현')
    else:
        sel44.append('도재수')
print(sel44)
'''